mbouyer/canbus_solar_mppt/software/pic18_mppt/main.c
/* $Id: main.c,v 1.36 2019/03/12 19:24:19 bouyer Exp $ */
/*
 * Copyright (c) 2023 Manuel Bouyer
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
 * ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
 * TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
 * BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 */

#include <xc.h>
#include <stdio.h> 
#include <string.h> 
#include <stdlib.h> 
#include <nmea2000.h>
#include <nmea2000_pgn.h>
#include <raddeg.h>
#include "serial.h"
#include "i2c.h"
#include "ntc_tab.h"
#include "pac195x.h"
#include "font5x8.h"
#include "font10x16.h"
#include "icons16x16.h"

typedef unsigned char u_char;
typedef unsigned int  u_int;
typedef unsigned long u_long;

static u_char default_src;

u_int devid, revid; 

u_long nmea2000_user_id; 

static u_char sid;

static struct nmea2000_msg msg;
static u_char nmea2000_data[NMEA2000_DATA_FASTLENGTH];

u_int timer0_read(void);

#define TIMER0_5MS 48
#define TIMER0_1MS 10

#define NCANOK PORTCbits.RC2

static char counter_10hz;
static char counter_1hz;
static uint16_t seconds;
static volatile union softintrs {
	struct softintrs_bits {
		char int_10hz : 1;	/* 0.1s timer */
		char int_btn_down : 1;	/* button release->press */
		char int_btn_up : 1;	/* button press->release */
		char int_adcc : 1;	/* A/D convertion complete */
	} bits;
	char byte;
} softintrs;

static uint16_t a2d_acc;

static uint16_t board_temp;

static enum {
	BTN_IDLE = 0,
	BTN_DOWN,
	BTN_DOWN_1,
	BTN_DOWN_1_P,
	BTN_DOWN_2,
	BTN_DOWN_2_P,
	BTN_UP
} btn_state;


#define PAC_I2C_ADDR 0x2e
#define NDOWN LATCbits.LATC7

static volatile i2c_return_t i2c_return;

int16_t batt_v[4];
int16_t batt_i[4];

static int32_t voltages_acc[4];
pac_ctrl_t pac_ctrl;

/* for journal */
static int64_t l600_current_acc[4];
static __uint24 l600_current_count;
static uint32_t l600_voltages_acc[4];

/* PAC 195x state machine */

static struct pac_i2c_io {
	enum {
		PAC_FREE = 0,
		PAC_WRITE, /* general register write */
		PAC_READ, /* general register read */
		PAC_READ_ACCUM, /* read accumulator values */
		PAC_READ_AVG, /* read recent average values */
	} pac_type;
	u_char pac_reg; /* register address */
	void *pac_data; /* pointer to data for read/write */
	u_char pac_datalen;
} pac_i2c_io;

#define PAC_WRITEREG(reg, data) {\
	pac_i2c_io.pac_type = PAC_WRITE;\
	pac_i2c_io.pac_reg = (reg);\
	pac_i2c_io.pac_data = &(data);\
	pac_i2c_io.pac_datalen = sizeof(data);\
	pac_i2c_state = PAC_I2C_WAIT;\
	}

#define PAC_READREG(reg, data) {\
	pac_i2c_io.pac_type = PAC_READ;\
	pac_i2c_io.pac_reg = (reg);\
	pac_i2c_io.pac_data = &(data);\
	pac_i2c_io.pac_datalen = sizeof(data);\
	pac_i2c_state = PAC_I2C_WAIT;\
	}

#define PAC_WRITECMD(reg) {\
	pac_i2c_io.pac_type = PAC_WRITE;\
	pac_i2c_io.pac_reg = (reg);\
	pac_i2c_io.pac_data = NULL;\
	pac_i2c_io.pac_datalen = 0;\
	pac_i2c_state = PAC_I2C_WAIT;\
	}

/*
 * buffer to read accumulator count and all channel accumulators at once
 * as we're using readreg_be, the register order is inverted
 */
static struct { 
	u_char accum[3*7]; 
	uint16_t acc_count;
} _read_accum;

/*
 * buffer to read voltage/current values at once 
 * as we're using readreg_be, the register order is inverted
 */
static struct {
	int16_t batt_i[4];
	int16_t batt_v[4];
} _read_voltcur;

static enum {
	PAC_I2C_IDLE,
	PAC_I2C_WAIT, /* waiting for i2c bus */
	PAC_I2C_WRITE,/* sending data */
	PAC_I2C_READ, /* reading data */
} pac_i2c_state;

static void
pac_i2c_exec(void)
{
	switch(pac_i2c_state) {
	case PAC_I2C_IDLE:
		return;
	case PAC_I2C_WAIT:
		switch(pac_i2c_io.pac_type) {
		case PAC_WRITE:
			i2c_writereg_be(PAC_I2C_ADDR, pac_i2c_io.pac_reg,
			    pac_i2c_io.pac_data, pac_i2c_io.pac_datalen,
			    &i2c_return);
			pac_i2c_state = PAC_I2C_WRITE;
			return;
		case PAC_READ:
			i2c_readreg_be(PAC_I2C_ADDR, pac_i2c_io.pac_reg,
			    pac_i2c_io.pac_data, pac_i2c_io.pac_datalen,
			    &i2c_return);
			pac_i2c_state = PAC_I2C_READ;
			return;
		case PAC_READ_ACCUM:
			i2c_readreg_be(PAC_I2C_ADDR, PAC_ACCCNT,
			    (void *)&_read_accum, sizeof(_read_accum), &i2c_return);
			pac_i2c_state = PAC_I2C_READ;
			return;
		case PAC_READ_AVG:
			i2c_readreg_be(PAC_I2C_ADDR, PAC_VBUS1_AVG,
			    (void *)&_read_voltcur, sizeof(_read_voltcur), &i2c_return);
			pac_i2c_state = PAC_I2C_READ;
			return;
		default:
			printf("pac_i2c_exec PAC_I2C_WAIT bad type %d\n",
			    pac_i2c_io.pac_type);
		}
		return;
	case PAC_I2C_WRITE:
	case PAC_I2C_READ:
		switch(i2c_return) {
		case I2C_INPROGRESS:
			return;
		case I2C_COMPLETE:
			pac_i2c_io.pac_type = PAC_FREE;
			pac_i2c_state = PAC_I2C_IDLE;
			return;
		case I2C_ERROR:
			/* XXX */
			printf("pac command %d fail\n", 
			    pac_i2c_io.pac_type);
			pac_i2c_io.pac_type = PAC_FREE;
			pac_i2c_state = PAC_I2C_IDLE;
			return;
		}
	}
}

static char
pac_i2c_flush(void)
{
	while (pac_i2c_state != PAC_I2C_IDLE) {
		pac_i2c_exec();
		if (i2c_wait(&i2c_return) != 0) {
			printf("pac_i2c_flush: error %d state %d io_state %d\n",
			    i2c_return, pac_i2c_state, pac_i2c_io.pac_type);
			return 0;
		}
	}
	return 1;
}

