mbouyer/canbus_solar_mppt/software/pic18_mppt/main.c
static enum {
	OLED_I2C_IDLE,
	OLED_I2C_WAIT, /* waiting for i2c bus */
	OLED_I2C_CMD, /* command sent */
	OLED_I2C_DATA, /* data sent */
} oled_i2c_state;

static u_char oled_i2c_prod;
static u_char oled_i2c_cons;

static void
_oled_i2c_exec(void)
{
	struct oled_i2c_buf_s *oled_s;

	switch(oled_i2c_state) {
	case OLED_I2C_IDLE:
		return;
	case OLED_I2C_WAIT:
		while (oled_i2c_buf[oled_i2c_cons].oled_type == OLED_CTRL_FREE) {
			oled_i2c_cons = (oled_i2c_cons + 1) & (OLED_NBUFS - 1);
			if (oled_i2c_cons == oled_i2c_prod &&
			    oled_i2c_buf[oled_i2c_cons].oled_type == OLED_CTRL_FREE) {
				return;
			}
		}
		oled_s = &oled_i2c_buf[oled_i2c_cons];
		i2c_writereg(OLED_ADDR, 0, &oled_s->oled_ctrlbuf[0],
		    oled_s->oled_ctrllen, &i2c_return);
		oled_i2c_state = OLED_I2C_CMD;
		return;
	case OLED_I2C_CMD:
		oled_s = &oled_i2c_buf[oled_i2c_cons];
		switch(oled_s->oled_type) {
		case OLED_CTRL_DISPLAY:
			i2c_writereg_dma(OLED_ADDR, 0x40, &oled_s->oled_databuf[0],
			    oled_s->oled_datalen, &i2c_return);
			oled_i2c_state = OLED_I2C_DATA;
			return;
		case OLED_CTRL_CMD:
			oled_i2c_state = OLED_I2C_IDLE;
			oled_s->oled_type = OLED_CTRL_FREE;
			return;
		case OLED_CTRL_CLEAR:
			break;
		default:
			printf("oled_i2c_exec: OLED_I2C_CMD cons %d cons_state %d\n",
			    oled_i2c_cons,
			    oled_i2c_buf[oled_i2c_cons].oled_type);
			return;
		}
		/* FALLTHROUGH */
	case OLED_I2C_DATA:
		oled_s = &oled_i2c_buf[oled_i2c_cons];
		switch(oled_s->oled_type) {
		case OLED_CTRL_DISPLAY:
			oled_i2c_state = OLED_I2C_IDLE;
			oled_s->oled_type = OLED_CTRL_FREE;
			return;
		case OLED_CTRL_CLEAR:
			if (oled_s->oled_datalen != 0) {
				i2c_writereg_dma(OLED_ADDR, 0x40,
				    &oled_s->oled_databuf[0],
				    OLED_I2C_DATABUFSZ, &i2c_return);
				oled_s->oled_datalen -= OLED_I2C_DATABUFSZ;
				oled_i2c_state = OLED_I2C_DATA;
			} else {
				oled_i2c_state = OLED_I2C_IDLE;
				oled_s->oled_type = OLED_CTRL_FREE;
			}
			return;
		default:
			break;
		}
	default:
		printf("oled_i2c_exec: state %d cons %d cons_state %d\n",
		    oled_i2c_state, oled_i2c_cons,
		    oled_i2c_buf[oled_i2c_cons].oled_type);
	}
}

static void
oled_i2c_exec(void)
{
	_oled_i2c_exec();
	if (oled_i2c_state == OLED_I2C_IDLE &&
	    oled_i2c_cons != oled_i2c_prod) {
		/* schedule next command */
		oled_i2c_cons = (oled_i2c_cons + 1) & (OLED_NBUFS - 1);
		oled_i2c_state = OLED_I2C_WAIT;
	}
}

static char
oled_i2c_flush(void)
{
	while (oled_i2c_state != OLED_I2C_IDLE) {
		oled_i2c_exec();
		if (i2c_wait(&i2c_return) != 0) {
			printf("oled_i2c_flush: error %d state %d cons %d cons_state %d\n",
			    i2c_return, oled_i2c_state, oled_i2c_cons,
			    oled_i2c_buf[oled_i2c_cons].oled_type);
			return 0;
		}
	}
	return 1;
}
			

#define OLED_CTRL(s, c) \
        {(s)->oled_ctrlbuf[(s)->oled_ctrllen++] = (c);}

static struct oled_i2c_buf_s *
oled_i2c_reset(void)
{
	/* select next free slot */
	while (oled_i2c_buf[oled_i2c_prod].oled_type != OLED_CTRL_FREE) {
		oled_i2c_prod = (oled_i2c_prod + 1) & (OLED_NBUFS - 1);
		if (oled_i2c_prod == oled_i2c_cons) {
			/* no free slot */
			return NULL;
		}
	}
	oled_i2c_buf[oled_i2c_prod].oled_datalen = 0;
	oled_i2c_buf[oled_i2c_prod].oled_ctrllen = 0;
	return &oled_i2c_buf[oled_i2c_prod];
}
#define OLED_CTRL_WRITE {oled_s->oled_type = OLED_CTRL_CMD; oled_i2c_state = OLED_I2C_WAIT; oled_i2c_flush(); oled_i2c_reset();}
	
static void
displaybuf_small(void)
{
	const u_char *font;
	char *cp;
	u_char i;
	struct oled_i2c_buf_s *oled_s;

	if ((oled_s = oled_i2c_reset()) == NULL)
		return;

	for (cp = oled_displaybuf; *cp != '\0'; cp++) {
		font = get_font5x8(*cp);
		for (i = 0; i < 5; i++) {
			oled_s->oled_databuf[oled_s->oled_datalen++] = font[i];
		}
		oled_s->oled_databuf[oled_s->oled_datalen++] = 0;
	}
	/* set column start/end */
	OLED_CTRL(oled_s, 0x00); OLED_CTRL(oled_s, 0x10);  /* reset column start */
	OLED_CTRL(oled_s, 0x21); OLED_CTRL(oled_s, oled_col);
	    OLED_CTRL(oled_s, oled_col + (u_char)oled_s->oled_datalen - 1); /*column start/end */
	/* set page address */
	OLED_CTRL(oled_s, (oled_line & 0x07 ) | 0xb0 );
	oled_s->oled_type = OLED_CTRL_DISPLAY;
	if (oled_i2c_state == OLED_I2C_IDLE)
		oled_i2c_state = OLED_I2C_WAIT;
}

static void
displaybuf_medium(void)
{
	const u_char *font;
	char *cp;
	u_char i, n;
	struct oled_i2c_buf_s *oled_s;

	if ((oled_s = oled_i2c_reset()) == NULL)
		return;
	/* unfortunably we can't build the two lines in a single loop */
	for (n = 0, cp = oled_displaybuf; *cp != '\0'; cp++) {
		font = get_font10x16(*cp);
		for (i = 0; i < 10; i++, n++) {
			oled_s->oled_databuf[n] = font[i * 2];
		}
	}
	for (cp = oled_displaybuf; *cp != '\0'; cp++) {
		font = get_font10x16(*cp);
		for (i = 0; i < 10; i++, n++) {
			oled_s->oled_databuf[n] = font[i * 2 + 1];
		}
	}
	oled_s->oled_datalen = n;
	OLED_CTRL(oled_s, 0x00); OLED_CTRL(oled_s, 0x10);  /* reset column start */
	OLED_CTRL(oled_s, 0x21); OLED_CTRL(oled_s, oled_col); OLED_CTRL(oled_s, oled_col + n / 2 - 1); /*column start/end */
	/* set page address */
	OLED_CTRL(oled_s, (oled_line & 0x07 ) | 0xb0 );
	oled_s->oled_type = OLED_CTRL_DISPLAY;
	if (oled_i2c_state == OLED_I2C_IDLE)
		oled_i2c_state = OLED_I2C_WAIT;
}

static void
displaybuf_icon(char ic)
{
	const u_char *icon;
	char *cp;
	u_char i;
	struct oled_i2c_buf_s *oled_s;

	if ((oled_s = oled_i2c_reset()) == NULL)
		return;
	icon = get_icons16x16(ic);
	for (i = 0; i < 16; i++) {
		oled_s->oled_databuf[i] = icon[i * 2];
		oled_s->oled_databuf[i + 16] = icon[i * 2 + 1];
	}
	oled_s->oled_datalen = 32;
	OLED_CTRL(oled_s, 0x00); OLED_CTRL(oled_s, 0x10);  /* reset column start */
	OLED_CTRL(oled_s, 0x21); OLED_CTRL(oled_s, oled_col); OLED_CTRL(oled_s, oled_col + 16 - 1); /*column start/end */
	/* set page address */
	OLED_CTRL(oled_s, (oled_line & 0x07 ) | 0xb0 );
	oled_s->oled_type = OLED_CTRL_DISPLAY;
	if (oled_i2c_state == OLED_I2C_IDLE)
		oled_i2c_state = OLED_I2C_WAIT;
}

int
main(void)
{
	char c;
	uint16_t l;
	uint8_t i2cr;
	pac_accumcfg_t pac_accumcfg;
	pac_neg_pwr_fsr_t pac_neg_pwr_fsr;
	static u_int poll_count;
	uint16_t t0;
	static int32_t voltages_acc_cur[4];
	uint8_t new_boot;
	struct oled_i2c_buf_s *oled_s;

	default_src = 0;
	devid = 0;
	revid = 0;
	nmea2000_user_id = 0;
	/* read devid and user IDs */
	TBLPTR = 0x200000;
	asm("tblrd*+;");
	asm("movff TABLAT, _nmea2000_user_id;");
	asm("tblrd*+;");
	asm("movff TABLAT, _nmea2000_user_id + 1;");
	TBLPTR = 0x3ffffc;
	asm("tblrd*+;");
	asm("movff TABLAT, _revid;");
	asm("tblrd*+;");
	asm("movff TABLAT, _revid + 1;");
	asm("tblrd*+;");
	asm("movff TABLAT, _devid;");
	asm("tblrd*+;");
	asm("movff TABLAT, _devid + 1;");

