mbouyer/canbus_solar_mppt/software/pic18_mppt/main.c
	NDOWN = 1;
	/* wait 50ms for pac1953 to be up */
	for (c = 0; c < 50; c++) {
		t0 = timer0_read();
		while (timer0_read() - t0 < TIMER0_1MS) {
			; /* wait */
		}
	}

#ifdef USELOG
#if 0
	log_erase();
#endif

	/* look for current block */
	printf("blocks");
	for (c = 0; c < LOG_BLOCKS; c++) {
		printf(" 0x%x", battlog[c].b_flags);
		if ((battlog[c].b_flags & B_FILL_STAT) == B_FILL_PART) {
			/* found it */
			log_cblk = c;
			log_gen = battlog[c].b_flags & B_FILL_GEN;
			break;
		}
		if ((battlog[c].b_flags & B_FILL_STAT) == B_FILL_FULL) {
			uint8_t c2 = (c + 1) & LOG_BLOCKS_MASK;
			if ((battlog[c2].b_flags & B_FILL_STAT)
			    == B_FILL_FREE) {
				/* stopped just at boundary */
				log_cblk = c2;
				log_gen = battlog[c].b_flags & B_FILL_GEN;
				if (log_cblk == 0)
					log_gen += 0x4;
				break;
			}
		}
	}
	printf("\n");
	if (c == LOG_BLOCKS) {
		/* log empty, start a 0 */
		printf("log empty\n");
		log_cblk = 0;
		log_gen = 0;
	}
	/* look for first free entry in block */
	for (c = 0; c < LOG_ENTRIES; c++) {
		if (battlog[log_cblk].b_entry[c].s.nvalid == 1) {
			/* first free entry */
			log_centry = c;
			break;
		}
	}
	if (c == LOG_ENTRIES) {
		/* log corrupted, reset */
		printf("non-full block with no free entry: reset log\n");
		log_erase();
	}
	page_read(&battlog[log_cblk]);

	memset(&curlog.b_entry[log_centry], 0, sizeof(union log_entry));

	next_log_entry();
#endif /* USELOG */

again:
	c = 0;
	PAC_READREG(PAC_PRODUCT, i2cr);
	if (pac_i2c_flush() == 0)
		c++;
	else 
		printf("product id 0x%x ", i2cr);

	PAC_READREG(PAC_MANUF, i2cr);
	if (pac_i2c_flush() == 0)
		c++;
	else
		printf("manuf id 0x%x ", i2cr);

	PAC_READREG(PAC_REV, i2cr);
	if (pac_i2c_flush() == 0)
		c++;
	else
		printf("rev id 0x%x\n", i2cr);

	PAC_READREG(PAC_CTRL_ACT, pac_ctrl);
	if (pac_i2c_flush() == 0)
		c++;
	else {
		printf("CTRL_ACT al1 %d al2 %d mode %d dis %d\n",
		    pac_ctrl.ctrl_alert1,
		    pac_ctrl.ctrl_alert2,
		    pac_ctrl.ctrl_mode,
		    pac_ctrl.ctrl_chan_dis);
	}

#ifdef USEPAC
	pac_ctrl.ctrl_alert1 = pac_ctrl.ctrl_alert2 = CTRL_ALERT_ALERT;
	pac_ctrl.ctrl_mode = CTRL_MODE_1024;

	PAC_WRITEREG(PAC_CTRL, pac_ctrl);
	if (pac_i2c_flush() == 0) {
		printf("wr PAC_CTRL fail\n");
		c++;
	}

	pac_accumcfg.accumcfg_acc1 = ACCUMCFG_VSENSE;
	pac_accumcfg.accumcfg_acc2 = ACCUMCFG_VSENSE;
	pac_accumcfg.accumcfg_acc3 = ACCUMCFG_VSENSE;
	pac_accumcfg.accumcfg_acc4 = ACCUMCFG_VSENSE;
	PAC_WRITEREG(PAC_ACCUMCFG, pac_accumcfg);
	if (pac_i2c_flush() == 0) {
		printf("wr PAC_ACCUMCFG fail\n");
		c++;
	}

	pac_neg_pwr_fsr.pwrfsr_vb1 = pac_neg_pwr_fsr.pwrfsr_vs1 = PAC_PWRSFR_BHALF;
	pac_neg_pwr_fsr.pwrfsr_vb2 = pac_neg_pwr_fsr.pwrfsr_vs2 = PAC_PWRSFR_BHALF;
	pac_neg_pwr_fsr.pwrfsr_vb3 = pac_neg_pwr_fsr.pwrfsr_vs3 = PAC_PWRSFR_BHALF;
	pac_neg_pwr_fsr.pwrfsr_vb4 = pac_neg_pwr_fsr.pwrfsr_vs4 = PAC_PWRSFR_BHALF;
	PAC_WRITEREG(PAC_NEG_PWR_FSR, pac_neg_pwr_fsr);
	if (pac_i2c_flush() == 0) {
		printf("wr PAC_NEG_PWR_FSR fail\n");
		c++;
	}

	PAC_WRITECMD(PAC_REFRESH);
	if (pac_i2c_flush() == 0) {
		printf("cmd PAC_REFRESH fail\n");
		c++;
	}
	if (c != 0)
		goto again;
#endif /* USEPAC */

	oled_col = 20;
	oled_line = 5;
	sprintf(oled_displaybuf, "hello");
	displaybuf_medium();
	oled_i2c_flush();

	for (c = 0; c < 4; c++) {
		oled_col = 20 * c;
		oled_line = 1;
		displaybuf_icon(c);
	}
	oled_i2c_flush();

	btn_state = BTN_IDLE;

	FVRCON = 0x8c; /* FVR on, CDAFVR 4.096v */

	CM1CON0 = 0x42; /* invert polarity, hysteresis */
	CM1CON1 = 0x03; /* interrupt on both edges */
	CM1NCH = 0x01; /* CH1IN1- */
	CM1PCH = 0x06; /* FVR */
	CM1CON0bits.EN = 1;
	PIR1bits.C1IF = 0; /* clear any pending interrupt */
	PIE1bits.C1IE = 1; /* enable */

	while (1) {
		CLRWDT();
		if (C1INTLbits.RXIF) {
			nmea2000_receive();
		}
		if (NCANOK) {
			nmea2000_status = NMEA2000_S_ABORT;
			poll_count = timer0_read();;
		} else if (nmea2000_status != NMEA2000_S_OK) {
			uint16_t ticks, tmrv;

			tmrv = timer0_read();
			ticks = tmrv - poll_count;
			if (ticks > TIMER0_5MS) {
				poll_count = tmrv;
				nmea2000_poll(
				    (u_char)(ticks / TIMER0_1MS));
			}
			if (nmea2000_status == NMEA2000_S_OK) {
				printf("new addr %d\n", nmea2000_addr);
			}
		}

#ifdef USEADC
		if (PIR1bits.ADIF) {
			PIR1bits.ADIF = 0;
			a2d_acc = ((u_int)ADRESH << 8) | ADRESL;
			switch (ADPCH) {
			case 0:
				/* channel 0: NTC */
				adctotemp(0);
				ADCON0bits.ADON = 0;
				ADPCH = 1;
				ADCON0bits.ADON = 1;
				break;
			case 1:
				/* channel 1: NTC */
				adctotemp(1);
				ADCON0bits.ADON = 0;
				ADPCH = 4;
				ADCON0bits.ADON = 1;
				break;
			case 4:
				/* channel 4: NTC */
				adctotemp(2);
				ADCON0bits.ADON = 0;
				ADPCH = 0;
				/* don't set ADON, will do on next second */
				break;
			default:
				printf("unknown channel 0x%x\n", ADCON0);
			}
		}
#endif

		if (softintrs.bits.int_btn_down) {
			softintrs.bits.int_btn_down = 0;
			if (btn_state == BTN_IDLE) {
				btn_state = BTN_DOWN;
				/* get btn value */
				/* XXX context */
				ADCTX = 3;
				PIR1bits.ADIF = 0;
				PIE1bits.ADIE = 1;
				ADCON0bits.ADON = 1;
			}
		}
		if (softintrs.bits.int_btn_up) {
			switch(btn_state) {
			case BTN_DOWN_1_P:
			case BTN_DOWN_2_P:
				softintrs.bits.int_btn_up = 0;
				/* this is a up event */
				btn_state = BTN_UP;
				break;
			BTN_DOWN:
			case BTN_DOWN_1:
			case BTN_DOWN_2:
				/* not ready for an UP event yet, wait */
				break;
			default:
				/* transient event */
				softintrs.bits.int_btn_up = 0;
				btn_state = BTN_IDLE;
				break;
			}
		}
		if (softintrs.bits.int_adcc) {
			if (btn_state == BTN_DOWN) {
				if (ADRES > 0x600 && ADRES < 0x900) {
					btn_state = BTN_DOWN_2;
				} else if (ADRES > 0x400 && ADRES < 0x600) {
					btn_state = BTN_DOWN_1;
				} else {
					/* transient event */
					btn_state = BTN_IDLE;
				}
			} else {
				btn_state = BTN_IDLE;
			}
			// printf("ADC complete 0x%x\n", ADRES);
			softintrs.bits.int_adcc = 0;
			PIR1bits.ADIF = 0;
			PIE1bits.ADIE = 0;
		}

		switch (btn_state) {
		case BTN_DOWN_1:
			oled_col = 40;
			oled_line = 4;
			sprintf(oled_displaybuf, "  B1 ");
			displaybuf_small();
			printf("B1\n");
			btn_state = BTN_DOWN_1_P;
			break;
		case BTN_DOWN_2:
			oled_col = 40;
			oled_line = 4;
			sprintf(oled_displaybuf, "  B2 ");
			displaybuf_small();
			printf("B2\n");
			btn_state = BTN_DOWN_2_P;
			break;
		case BTN_UP:
			oled_col = 40;
			oled_line = 4;
			sprintf(oled_displaybuf, "  up ");
			displaybuf_small();
			printf("up\n");
			btn_state = BTN_IDLE;
			break;
		default:
			break;
		}

